{
    "Google": {
        "Software Engineer Intern": "We're looking for software engineering interns to join Google's engineering team. You'll work on real projects that impact billions of users. Responsibilities include writing code, participating in design reviews, and collaborating with teams across Google. Required: Currently pursuing a BS/MS in Computer Science or related field, experience with data structures and algorithms, proficiency in one or more programming languages (Java, C++, Python). Preferred: Previous internship experience, contributions to open source projects.",
        "Product Manager": "Google is seeking Product Managers to lead product development from conception to launch. You'll work with engineers, designers, and business teams to build products that solve real user problems at scale. Responsibilities: Define product vision and strategy, prioritize features, analyze metrics, communicate with stakeholders. Required: 5+ years of product management experience, strong analytical skills, excellent communication. Preferred: Technical background, experience with consumer products.",
        "Marketing Manager": "Join Google's marketing team to develop and execute marketing strategies for our products. You'll analyze market trends, create campaigns, and work cross-functionally to drive user growth. Responsibilities: Develop marketing strategies, manage campaigns, analyze performance metrics, collaborate with product teams. Required: 3+ years marketing experience, data-driven mindset, strong communication skills. Preferred: Experience in tech industry, digital marketing expertise.",
        "Data Scientist": "Google seeks Data Scientists to extract insights from massive datasets and build ML models. You'll work on problems spanning search, ads, YouTube, and more. Responsibilities: Analyze complex datasets, build predictive models, communicate findings to stakeholders. Required: MS/PhD in quantitative field, proficiency in Python/R, experience with ML frameworks. Preferred: Publications in top-tier conferences, experience with large-scale systems."
    },
    "Microsoft": {
        "Software Engineer Intern": "Microsoft is hiring software engineering interns to work on Azure, Office, Windows, or other products. You'll contribute to production code and learn from experienced engineers. Responsibilities: Design and implement features, write tests, participate in code reviews. Required: Pursuing BS/MS in CS or related field, strong coding skills in C#/Java/Python, understanding of algorithms. Preferred: Previous internship, open source contributions.",
        "Cloud Solutions Architect": "Join Microsoft as a Cloud Solutions Architect to help customers design and implement Azure solutions. You'll work directly with enterprise clients to solve complex technical challenges. Responsibilities: Design cloud architectures, provide technical guidance, conduct workshops. Required: 5+ years experience with cloud platforms, strong communication skills, technical certifications. Preferred: Azure certifications, enterprise consulting experience.",
        "Product Marketing Manager": "Microsoft seeks Product Marketing Managers to drive go-to-market strategies for our products. You'll position products, create messaging, and enable sales teams. Responsibilities: Develop product positioning, create marketing content, analyze competitive landscape. Required: 4+ years product marketing experience, excellent writing skills, strategic thinking. Preferred: B2B SaaS experience, technical background.",
        "AI Research Scientist": "Microsoft Research is looking for AI Research Scientists to advance the state of the art in machine learning and AI. You'll publish research and build systems that impact Microsoft products. Responsibilities: Conduct research, publish papers, collaborate with product teams. Required: PhD in CS/ML or related field, strong publication record, expertise in deep learning. Preferred: Experience with large language models, contributions to major ML frameworks."
    },
    "Amazon": {
        "Software Development Engineer Intern": "Amazon is hiring SDE interns to work on services powering Amazon.com, AWS, Alexa, and more. You'll own projects end-to-end and see your code in production. Responsibilities: Design and implement scalable systems, write clean code, participate in on-call rotations. Required: Pursuing BS/MS in CS, strong problem-solving skills, proficiency in Java/C++/Python. Preferred: Experience with distributed systems, previous internship.",
        "Product Manager": "Join Amazon as a Product Manager to define and deliver products that delight customers. You'll work backwards from customer needs to build innovative solutions. Responsibilities: Define product requirements, prioritize roadmap, work with engineering teams, analyze metrics. Required: 3+ years PM experience, strong analytical skills, customer obsession. Preferred: Technical background, experience with e-commerce or AWS.",
        "Operations Manager": "Amazon seeks Operations Managers to lead teams in our fulfillment centers. You'll optimize processes, manage teams, and ensure customer orders are delivered on time. Responsibilities: Manage operations teams, improve processes, analyze performance metrics, ensure safety. Required: Bachelor's degree, 2+ years management experience, strong leadership skills. Preferred: Lean/Six Sigma certification, experience in logistics.",
        "Machine Learning Scientist": "Amazon is hiring ML Scientists to build recommendation systems, forecasting models, and other ML solutions. You'll work on problems at unprecedented scale. Responsibilities: Design ML systems, implement algorithms, deploy models to production. Required: MS/PhD in CS/ML, strong coding skills, experience with TensorFlow/PyTorch. Preferred: Publications in ML conferences, experience with recommender systems."
    },
    "Meta": {
        "Software Engineer Intern": "Meta (Facebook) is looking for software engineering interns to build products used by billions. You'll work on Facebook, Instagram, WhatsApp, or Reality Labs. Responsibilities: Write production code, collaborate with teams, ship features. Required: Pursuing BS/MS in CS, strong coding skills in C++/Python/Java, knowledge of algorithms. Preferred: Hackathon experience, mobile development skills.",
        "Product Designer": "Join Meta as a Product Designer to create intuitive experiences for our family of apps. You'll work closely with PMs and engineers to ship products. Responsibilities: Design user flows, create prototypes, conduct user research, iterate based on feedback. Required: 3+ years product design experience, strong portfolio, proficiency in Figma. Preferred: Experience with social products, motion design skills.",
        "Data Engineer": "Meta seeks Data Engineers to build infrastructure that powers data-driven decisions across the company. You'll work with petabyte-scale data. Responsibilities: Build data pipelines, optimize queries, ensure data quality. Required: 2+ years experience with SQL/Python, knowledge of distributed systems, strong CS fundamentals. Preferred: Experience with Spark/Hadoop, data warehouse expertise.",
        "Research Scientist": "Meta AI is hiring Research Scientists to advance AI research and build systems that power our products. You'll work on computer vision, NLP, or other AI domains. Responsibilities: Conduct research, publish papers, transfer research to products. Required: PhD in CS/AI or equivalent, strong publication record, expertise in deep learning. Preferred: Experience with PyTorch, contributions to major AI research."
    },
    "Netflix": {
        "Software Engineer": "Netflix is seeking Software Engineers to build the streaming platform that entertains millions globally. You'll work on personalization, streaming tech, or content delivery. Responsibilities: Design scalable systems, write high-quality code, participate in architecture decisions. Required: 2+ years software engineering experience, proficiency in Java/Python/JavaScript, strong system design skills. Preferred: Experience with microservices, cloud platforms (AWS).",
        "Content Strategist": "Join Netflix as a Content Strategist to shape our content slate and acquisition strategy. You'll analyze viewing data and market trends to inform content decisions. Responsibilities: Analyze content performance, identify acquisition opportunities, collaborate with content teams. Required: 3+ years in content strategy or analytics, strong analytical skills, passion for entertainment. Preferred: Experience in streaming industry, data science skills.",
        "Product Manager": "Netflix seeks Product Managers to define and build features that improve the member experience. You'll work on discovery, playback, or other product areas. Responsibilities: Define product vision, prioritize features, work with engineering and design. Required: 4+ years PM experience, strong analytical skills, user-centric mindset. Preferred: Experience with consumer products, A/B testing expertise.",
        "Machine Learning Engineer": "Netflix is hiring ML Engineers to build recommendation systems and personalization algorithms. You'll work on problems that directly impact member satisfaction. Responsibilities: Build ML models, deploy to production, analyze model performance. Required: 3+ years ML experience, proficiency in Python, experience with TensorFlow/PyTorch. Preferred: Experience with recommender systems, large-scale ML infrastructure."
    }
}